espressif/esp-idf/components/soc/esp32s2beta/include/soc/pcnt_reg.h
#define PCNT_U7_CONF1_REG          (DR_REG_PCNT_BASE + 0x0058)
/* PCNT_CNT_THRES1_U7 : R/W ;bitpos:[31:16] ;default: 10'h0 ; */
/*description: This register is used to configure  thres1 value for unit7.*/
#define PCNT_CNT_THRES1_U7  0x0000FFFF
#define PCNT_CNT_THRES1_U7_M  ((PCNT_CNT_THRES1_U7_V)<<(PCNT_CNT_THRES1_U7_S))
#define PCNT_CNT_THRES1_U7_V  0xFFFF
#define PCNT_CNT_THRES1_U7_S  16
/* PCNT_CNT_THRES0_U7 : R/W ;bitpos:[15:0] ;default: 10'h0 ; */
/*description: This register is used to configure thres0 value for unit7.*/
#define PCNT_CNT_THRES0_U7  0x0000FFFF
#define PCNT_CNT_THRES0_U7_M  ((PCNT_CNT_THRES0_U7_V)<<(PCNT_CNT_THRES0_U7_S))
#define PCNT_CNT_THRES0_U7_V  0xFFFF
#define PCNT_CNT_THRES0_U7_S  0

#define PCNT_U7_CONF2_REG          (DR_REG_PCNT_BASE + 0x005c)
/* PCNT_CNT_L_LIM_U7 : R/W ;bitpos:[31:16] ;default: 10'h0 ; */
/*description: This register is used to confiugre thr_l_lim value for unit7.*/
#define PCNT_CNT_L_LIM_U7  0x0000FFFF
#define PCNT_CNT_L_LIM_U7_M  ((PCNT_CNT_L_LIM_U7_V)<<(PCNT_CNT_L_LIM_U7_S))
#define PCNT_CNT_L_LIM_U7_V  0xFFFF
#define PCNT_CNT_L_LIM_U7_S  16
/* PCNT_CNT_H_LIM_U7 : R/W ;bitpos:[15:0] ;default: 10'h0 ; */
/*description: This register is used to configure thr_h_lim value for unit7.*/
#define PCNT_CNT_H_LIM_U7  0x0000FFFF
#define PCNT_CNT_H_LIM_U7_M  ((PCNT_CNT_H_LIM_U7_V)<<(PCNT_CNT_H_LIM_U7_S))
#define PCNT_CNT_H_LIM_U7_V  0xFFFF
#define PCNT_CNT_H_LIM_U7_S  0

#define PCNT_U0_CNT_REG          (DR_REG_PCNT_BASE + 0x0060)
/* PCNT_PULSE_CNT_U0 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define PCNT_PULSE_CNT_U0  0x0000FFFF
#define PCNT_PULSE_CNT_U0_M  ((PCNT_PULSE_CNT_U0_V)<<(PCNT_PULSE_CNT_U0_S))
#define PCNT_PULSE_CNT_U0_V  0xFFFF
#define PCNT_PULSE_CNT_U0_S  0

#define PCNT_U1_CNT_REG          (DR_REG_PCNT_BASE + 0x0064)
/* PCNT_PULSE_CNT_U1 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define PCNT_PULSE_CNT_U1  0x0000FFFF
#define PCNT_PULSE_CNT_U1_M  ((PCNT_PULSE_CNT_U1_V)<<(PCNT_PULSE_CNT_U1_S))
#define PCNT_PULSE_CNT_U1_V  0xFFFF
#define PCNT_PULSE_CNT_U1_S  0

#define PCNT_U2_CNT_REG          (DR_REG_PCNT_BASE + 0x0068)
/* PCNT_PULSE_CNT_U2 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define PCNT_PULSE_CNT_U2  0x0000FFFF
#define PCNT_PULSE_CNT_U2_M  ((PCNT_PULSE_CNT_U2_V)<<(PCNT_PULSE_CNT_U2_S))
#define PCNT_PULSE_CNT_U2_V  0xFFFF
#define PCNT_PULSE_CNT_U2_S  0

#define PCNT_U3_CNT_REG          (DR_REG_PCNT_BASE + 0x006c)
/* PCNT_PULSE_CNT_U3 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define PCNT_PULSE_CNT_U3  0x0000FFFF
#define PCNT_PULSE_CNT_U3_M  ((PCNT_PULSE_CNT_U3_V)<<(PCNT_PULSE_CNT_U3_S))
#define PCNT_PULSE_CNT_U3_V  0xFFFF
#define PCNT_PULSE_CNT_U3_S  0

#define PCNT_U4_CNT_REG          (DR_REG_PCNT_BASE + 0x0070)
/* PCNT_PULSE_CNT_U4 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define PCNT_PULSE_CNT_U4  0x0000FFFF
#define PCNT_PULSE_CNT_U4_M  ((PCNT_PULSE_CNT_U4_V)<<(PCNT_PULSE_CNT_U4_S))
#define PCNT_PULSE_CNT_U4_V  0xFFFF
#define PCNT_PULSE_CNT_U4_S  0

#define PCNT_U5_CNT_REG          (DR_REG_PCNT_BASE + 0x0074)
/* PCNT_PULSE_CNT_U5 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define PCNT_PULSE_CNT_U5  0x0000FFFF
#define PCNT_PULSE_CNT_U5_M  ((PCNT_PULSE_CNT_U5_V)<<(PCNT_PULSE_CNT_U5_S))
#define PCNT_PULSE_CNT_U5_V  0xFFFF
#define PCNT_PULSE_CNT_U5_S  0

#define PCNT_U6_CNT_REG          (DR_REG_PCNT_BASE + 0x0078)
/* PCNT_PULSE_CNT_U6 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define PCNT_PULSE_CNT_U6  0x0000FFFF
#define PCNT_PULSE_CNT_U6_M  ((PCNT_PULSE_CNT_U6_V)<<(PCNT_PULSE_CNT_U6_S))
#define PCNT_PULSE_CNT_U6_V  0xFFFF
#define PCNT_PULSE_CNT_U6_S  0

#define PCNT_U7_CNT_REG          (DR_REG_PCNT_BASE + 0x007c)
/* PCNT_PULSE_CNT_U7 : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define PCNT_PULSE_CNT_U7  0x0000FFFF
#define PCNT_PULSE_CNT_U7_M  ((PCNT_PULSE_CNT_U7_V)<<(PCNT_PULSE_CNT_U7_S))
#define PCNT_PULSE_CNT_U7_V  0xFFFF
#define PCNT_PULSE_CNT_U7_S  0

#define PCNT_INT_RAW_REG          (DR_REG_PCNT_BASE + 0x0080)
/* PCNT_CNT_THR_EVENT_U7_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: This is the interrupt raw bit for channel7 event.*/
#define PCNT_CNT_THR_EVENT_U7_INT_RAW  (BIT(7))
#define PCNT_CNT_THR_EVENT_U7_INT_RAW_M  (BIT(7))
#define PCNT_CNT_THR_EVENT_U7_INT_RAW_V  0x1
#define PCNT_CNT_THR_EVENT_U7_INT_RAW_S  7
/* PCNT_CNT_THR_EVENT_U6_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: This is the interrupt raw bit for channel6 event.*/
#define PCNT_CNT_THR_EVENT_U6_INT_RAW  (BIT(6))
#define PCNT_CNT_THR_EVENT_U6_INT_RAW_M  (BIT(6))
#define PCNT_CNT_THR_EVENT_U6_INT_RAW_V  0x1
#define PCNT_CNT_THR_EVENT_U6_INT_RAW_S  6
/* PCNT_CNT_THR_EVENT_U5_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: This is the interrupt raw bit for channel5 event.*/
#define PCNT_CNT_THR_EVENT_U5_INT_RAW  (BIT(5))
#define PCNT_CNT_THR_EVENT_U5_INT_RAW_M  (BIT(5))
#define PCNT_CNT_THR_EVENT_U5_INT_RAW_V  0x1
#define PCNT_CNT_THR_EVENT_U5_INT_RAW_S  5
/* PCNT_CNT_THR_EVENT_U4_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: This is the interrupt raw bit for channel4 event.*/
#define PCNT_CNT_THR_EVENT_U4_INT_RAW  (BIT(4))
#define PCNT_CNT_THR_EVENT_U4_INT_RAW_M  (BIT(4))
#define PCNT_CNT_THR_EVENT_U4_INT_RAW_V  0x1
#define PCNT_CNT_THR_EVENT_U4_INT_RAW_S  4
/* PCNT_CNT_THR_EVENT_U3_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: This is the interrupt raw bit for channel3 event.*/
#define PCNT_CNT_THR_EVENT_U3_INT_RAW  (BIT(3))
#define PCNT_CNT_THR_EVENT_U3_INT_RAW_M  (BIT(3))
#define PCNT_CNT_THR_EVENT_U3_INT_RAW_V  0x1
#define PCNT_CNT_THR_EVENT_U3_INT_RAW_S  3
/* PCNT_CNT_THR_EVENT_U2_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: This is the interrupt raw bit for channel2 event.*/
#define PCNT_CNT_THR_EVENT_U2_INT_RAW  (BIT(2))
#define PCNT_CNT_THR_EVENT_U2_INT_RAW_M  (BIT(2))
#define PCNT_CNT_THR_EVENT_U2_INT_RAW_V  0x1
#define PCNT_CNT_THR_EVENT_U2_INT_RAW_S  2
/* PCNT_CNT_THR_EVENT_U1_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: This is the interrupt raw bit for channel1 event.*/
#define PCNT_CNT_THR_EVENT_U1_INT_RAW  (BIT(1))
#define PCNT_CNT_THR_EVENT_U1_INT_RAW_M  (BIT(1))
#define PCNT_CNT_THR_EVENT_U1_INT_RAW_V  0x1
#define PCNT_CNT_THR_EVENT_U1_INT_RAW_S  1
/* PCNT_CNT_THR_EVENT_U0_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: This is the interrupt raw bit for channel0 event.*/
#define PCNT_CNT_THR_EVENT_U0_INT_RAW  (BIT(0))
#define PCNT_CNT_THR_EVENT_U0_INT_RAW_M  (BIT(0))
#define PCNT_CNT_THR_EVENT_U0_INT_RAW_V  0x1
#define PCNT_CNT_THR_EVENT_U0_INT_RAW_S  0

#define PCNT_INT_ST_REG          (DR_REG_PCNT_BASE + 0x0084)
/* PCNT_CNT_THR_EVENT_U7_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: This is the  interrupt status bit for channel7 event.*/
#define PCNT_CNT_THR_EVENT_U7_INT_ST  (BIT(7))
#define PCNT_CNT_THR_EVENT_U7_INT_ST_M  (BIT(7))
#define PCNT_CNT_THR_EVENT_U7_INT_ST_V  0x1
#define PCNT_CNT_THR_EVENT_U7_INT_ST_S  7
/* PCNT_CNT_THR_EVENT_U6_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: This is the  interrupt status bit for channel6 event.*/
#define PCNT_CNT_THR_EVENT_U6_INT_ST  (BIT(6))
#define PCNT_CNT_THR_EVENT_U6_INT_ST_M  (BIT(6))
#define PCNT_CNT_THR_EVENT_U6_INT_ST_V  0x1
#define PCNT_CNT_THR_EVENT_U6_INT_ST_S  6
/* PCNT_CNT_THR_EVENT_U5_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: This is the  interrupt status bit for channel5 event.*/
#define PCNT_CNT_THR_EVENT_U5_INT_ST  (BIT(5))
#define PCNT_CNT_THR_EVENT_U5_INT_ST_M  (BIT(5))
#define PCNT_CNT_THR_EVENT_U5_INT_ST_V  0x1
#define PCNT_CNT_THR_EVENT_U5_INT_ST_S  5
/* PCNT_CNT_THR_EVENT_U4_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: This is the  interrupt status bit for channel4 event.*/
#define PCNT_CNT_THR_EVENT_U4_INT_ST  (BIT(4))
#define PCNT_CNT_THR_EVENT_U4_INT_ST_M  (BIT(4))
#define PCNT_CNT_THR_EVENT_U4_INT_ST_V  0x1
#define PCNT_CNT_THR_EVENT_U4_INT_ST_S  4
/* PCNT_CNT_THR_EVENT_U3_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: This is the  interrupt status bit for channel3 event.*/
#define PCNT_CNT_THR_EVENT_U3_INT_ST  (BIT(3))
#define PCNT_CNT_THR_EVENT_U3_INT_ST_M  (BIT(3))
#define PCNT_CNT_THR_EVENT_U3_INT_ST_V  0x1
#define PCNT_CNT_THR_EVENT_U3_INT_ST_S  3
/* PCNT_CNT_THR_EVENT_U2_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: This is the  interrupt status bit for channel2 event.*/
#define PCNT_CNT_THR_EVENT_U2_INT_ST  (BIT(2))
#define PCNT_CNT_THR_EVENT_U2_INT_ST_M  (BIT(2))
#define PCNT_CNT_THR_EVENT_U2_INT_ST_V  0x1
#define PCNT_CNT_THR_EVENT_U2_INT_ST_S  2
/* PCNT_CNT_THR_EVENT_U1_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: This is the  interrupt status bit for channel1 event.*/
#define PCNT_CNT_THR_EVENT_U1_INT_ST  (BIT(1))
#define PCNT_CNT_THR_EVENT_U1_INT_ST_M  (BIT(1))
#define PCNT_CNT_THR_EVENT_U1_INT_ST_V  0x1
#define PCNT_CNT_THR_EVENT_U1_INT_ST_S  1
/* PCNT_CNT_THR_EVENT_U0_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: This is the  interrupt status bit for channel0 event.*/
#define PCNT_CNT_THR_EVENT_U0_INT_ST  (BIT(0))
#define PCNT_CNT_THR_EVENT_U0_INT_ST_M  (BIT(0))
#define PCNT_CNT_THR_EVENT_U0_INT_ST_V  0x1
#define PCNT_CNT_THR_EVENT_U0_INT_ST_S  0

#define PCNT_INT_ENA_REG          (DR_REG_PCNT_BASE + 0x0088)
/* PCNT_CNT_THR_EVENT_U7_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: This is the  interrupt enable bit for channel7 event.*/
#define PCNT_CNT_THR_EVENT_U7_INT_ENA  (BIT(7))
#define PCNT_CNT_THR_EVENT_U7_INT_ENA_M  (BIT(7))
#define PCNT_CNT_THR_EVENT_U7_INT_ENA_V  0x1
#define PCNT_CNT_THR_EVENT_U7_INT_ENA_S  7
/* PCNT_CNT_THR_EVENT_U6_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: This is the  interrupt enable bit for channel6 event.*/
#define PCNT_CNT_THR_EVENT_U6_INT_ENA  (BIT(6))
#define PCNT_CNT_THR_EVENT_U6_INT_ENA_M  (BIT(6))
#define PCNT_CNT_THR_EVENT_U6_INT_ENA_V  0x1
#define PCNT_CNT_THR_EVENT_U6_INT_ENA_S  6
/* PCNT_CNT_THR_EVENT_U5_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: This is the  interrupt enable bit for channel5 event.*/
#define PCNT_CNT_THR_EVENT_U5_INT_ENA  (BIT(5))
#define PCNT_CNT_THR_EVENT_U5_INT_ENA_M  (BIT(5))
#define PCNT_CNT_THR_EVENT_U5_INT_ENA_V  0x1
#define PCNT_CNT_THR_EVENT_U5_INT_ENA_S  5
/* PCNT_CNT_THR_EVENT_U4_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: This is the  interrupt enable bit for channel4 event.*/
#define PCNT_CNT_THR_EVENT_U4_INT_ENA  (BIT(4))
#define PCNT_CNT_THR_EVENT_U4_INT_ENA_M  (BIT(4))
#define PCNT_CNT_THR_EVENT_U4_INT_ENA_V  0x1
#define PCNT_CNT_THR_EVENT_U4_INT_ENA_S  4
/* PCNT_CNT_THR_EVENT_U3_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: This is the  interrupt enable bit for channel3 event.*/
#define PCNT_CNT_THR_EVENT_U3_INT_ENA  (BIT(3))
#define PCNT_CNT_THR_EVENT_U3_INT_ENA_M  (BIT(3))
#define PCNT_CNT_THR_EVENT_U3_INT_ENA_V  0x1
#define PCNT_CNT_THR_EVENT_U3_INT_ENA_S  3
/* PCNT_CNT_THR_EVENT_U2_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: This is the  interrupt enable bit for channel2 event.*/
#define PCNT_CNT_THR_EVENT_U2_INT_ENA  (BIT(2))
#define PCNT_CNT_THR_EVENT_U2_INT_ENA_M  (BIT(2))
#define PCNT_CNT_THR_EVENT_U2_INT_ENA_V  0x1
#define PCNT_CNT_THR_EVENT_U2_INT_ENA_S  2
/* PCNT_CNT_THR_EVENT_U1_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: This is the  interrupt enable bit for channel1 event.*/
#define PCNT_CNT_THR_EVENT_U1_INT_ENA  (BIT(1))
#define PCNT_CNT_THR_EVENT_U1_INT_ENA_M  (BIT(1))
#define PCNT_CNT_THR_EVENT_U1_INT_ENA_V  0x1
#define PCNT_CNT_THR_EVENT_U1_INT_ENA_S  1
/* PCNT_CNT_THR_EVENT_U0_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: This is the  interrupt enable bit for channel0 event.*/
#define PCNT_CNT_THR_EVENT_U0_INT_ENA  (BIT(0))
#define PCNT_CNT_THR_EVENT_U0_INT_ENA_M  (BIT(0))
#define PCNT_CNT_THR_EVENT_U0_INT_ENA_V  0x1
#define PCNT_CNT_THR_EVENT_U0_INT_ENA_S  0

#define PCNT_INT_CLR_REG          (DR_REG_PCNT_BASE + 0x008c)
/* PCNT_CNT_THR_EVENT_U7_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear channel7 event interrupt.*/
#define PCNT_CNT_THR_EVENT_U7_INT_CLR  (BIT(7))
#define PCNT_CNT_THR_EVENT_U7_INT_CLR_M  (BIT(7))
#define PCNT_CNT_THR_EVENT_U7_INT_CLR_V  0x1
#define PCNT_CNT_THR_EVENT_U7_INT_CLR_S  7
/* PCNT_CNT_THR_EVENT_U6_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear channel6 event interrupt.*/
#define PCNT_CNT_THR_EVENT_U6_INT_CLR  (BIT(6))
#define PCNT_CNT_THR_EVENT_U6_INT_CLR_M  (BIT(6))
#define PCNT_CNT_THR_EVENT_U6_INT_CLR_V  0x1
#define PCNT_CNT_THR_EVENT_U6_INT_CLR_S  6
/* PCNT_CNT_THR_EVENT_U5_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear channel5 event interrupt.*/
#define PCNT_CNT_THR_EVENT_U5_INT_CLR  (BIT(5))
#define PCNT_CNT_THR_EVENT_U5_INT_CLR_M  (BIT(5))
#define PCNT_CNT_THR_EVENT_U5_INT_CLR_V  0x1
#define PCNT_CNT_THR_EVENT_U5_INT_CLR_S  5
/* PCNT_CNT_THR_EVENT_U4_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear channel4 event interrupt.*/
#define PCNT_CNT_THR_EVENT_U4_INT_CLR  (BIT(4))
#define PCNT_CNT_THR_EVENT_U4_INT_CLR_M  (BIT(4))
#define PCNT_CNT_THR_EVENT_U4_INT_CLR_V  0x1
#define PCNT_CNT_THR_EVENT_U4_INT_CLR_S  4
/* PCNT_CNT_THR_EVENT_U3_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear channel3 event interrupt.*/
#define PCNT_CNT_THR_EVENT_U3_INT_CLR  (BIT(3))
#define PCNT_CNT_THR_EVENT_U3_INT_CLR_M  (BIT(3))
#define PCNT_CNT_THR_EVENT_U3_INT_CLR_V  0x1
#define PCNT_CNT_THR_EVENT_U3_INT_CLR_S  3
/* PCNT_CNT_THR_EVENT_U2_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear channel2 event interrupt.*/
#define PCNT_CNT_THR_EVENT_U2_INT_CLR  (BIT(2))
#define PCNT_CNT_THR_EVENT_U2_INT_CLR_M  (BIT(2))
#define PCNT_CNT_THR_EVENT_U2_INT_CLR_V  0x1
#define PCNT_CNT_THR_EVENT_U2_INT_CLR_S  2
/* PCNT_CNT_THR_EVENT_U1_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear channel1 event interrupt.*/
#define PCNT_CNT_THR_EVENT_U1_INT_CLR  (BIT(1))
#define PCNT_CNT_THR_EVENT_U1_INT_CLR_M  (BIT(1))
#define PCNT_CNT_THR_EVENT_U1_INT_CLR_V  0x1
#define PCNT_CNT_THR_EVENT_U1_INT_CLR_S  1
/* PCNT_CNT_THR_EVENT_U0_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear channel0 event interrupt.*/
#define PCNT_CNT_THR_EVENT_U0_INT_CLR  (BIT(0))
#define PCNT_CNT_THR_EVENT_U0_INT_CLR_M  (BIT(0))
#define PCNT_CNT_THR_EVENT_U0_INT_CLR_V  0x1
#define PCNT_CNT_THR_EVENT_U0_INT_CLR_S  0

#define PCNT_U0_STATUS_REG          (DR_REG_PCNT_BASE + 0x0090)
/* PCNT_CORE_STATUS_U0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_LAT_U0  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U0_M  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U0_V  0x1
#define PCNT_CNT_THR_ZERO_LAT_U0_S  6
/* PCNT_CNT_THR_H_LIM_LAT_U0 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_H_LIM_LAT_U0  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U0_M  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U0_V  0x1
#define PCNT_CNT_THR_H_LIM_LAT_U0_S  5
/* PCNT_CNT_THR_L_LIM_LAT_U0 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_L_LIM_LAT_U0  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U0_M  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U0_V  0x1
#define PCNT_CNT_THR_L_LIM_LAT_U0_S  4
/* PCNT_CNT_THR_THRES0_LAT_U0 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES0_LAT_U0  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U0_M  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U0_V  0x1
#define PCNT_CNT_THR_THRES0_LAT_U0_S  3
/* PCNT_CNT_THR_THRES1_LAT_U0 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES1_LAT_U0  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U0_M  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U0_V  0x1
#define PCNT_CNT_THR_THRES1_LAT_U0_S  2
/* PCNT_CNT_THR_ZERO_MODE_U0 : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_MODE_U0  0x00000003
#define PCNT_CNT_THR_ZERO_MODE_U0_M  ((PCNT_CNT_THR_ZERO_MODE_U0_V)<<(PCNT_CNT_THR_ZERO_MODE_U0_S))
#define PCNT_CNT_THR_ZERO_MODE_U0_V  0x3
#define PCNT_CNT_THR_ZERO_MODE_U0_S  0

#define PCNT_U1_STATUS_REG          (DR_REG_PCNT_BASE + 0x0094)
/* PCNT_CNT_THR_ZERO_LAT_U1 : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_LAT_U1  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U1_M  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U1_V  0x1
#define PCNT_CNT_THR_ZERO_LAT_U1_S  6
/* PCNT_CNT_THR_H_LIM_LAT_U1 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_H_LIM_LAT_U1  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U1_M  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U1_V  0x1
#define PCNT_CNT_THR_H_LIM_LAT_U1_S  5
/* PCNT_CNT_THR_L_LIM_LAT_U1 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_L_LIM_LAT_U1  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U1_M  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U1_V  0x1
#define PCNT_CNT_THR_L_LIM_LAT_U1_S  4
/* PCNT_CNT_THR_THRES0_LAT_U1 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES0_LAT_U1  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U1_M  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U1_V  0x1
#define PCNT_CNT_THR_THRES0_LAT_U1_S  3
/* PCNT_CNT_THR_THRES1_LAT_U1 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES1_LAT_U1  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U1_M  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U1_V  0x1
#define PCNT_CNT_THR_THRES1_LAT_U1_S  2
/* PCNT_CNT_THR_ZERO_MODE_U1 : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_MODE_U1  0x00000003
#define PCNT_CNT_THR_ZERO_MODE_U1_M  ((PCNT_CNT_THR_ZERO_MODE_U1_V)<<(PCNT_CNT_THR_ZERO_MODE_U1_S))
#define PCNT_CNT_THR_ZERO_MODE_U1_V  0x3
#define PCNT_CNT_THR_ZERO_MODE_U1_S  0

#define PCNT_U2_STATUS_REG          (DR_REG_PCNT_BASE + 0x0098)
/* PCNT_CNT_THR_ZERO_LAT_U2 : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_LAT_U2  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U2_M  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U2_V  0x1
#define PCNT_CNT_THR_ZERO_LAT_U2_S  6
/* PCNT_CNT_THR_H_LIM_LAT_U2 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_H_LIM_LAT_U2  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U2_M  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U2_V  0x1
#define PCNT_CNT_THR_H_LIM_LAT_U2_S  5
/* PCNT_CNT_THR_L_LIM_LAT_U2 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_L_LIM_LAT_U2  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U2_M  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U2_V  0x1
#define PCNT_CNT_THR_L_LIM_LAT_U2_S  4
/* PCNT_CNT_THR_THRES0_LAT_U2 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES0_LAT_U2  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U2_M  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U2_V  0x1
#define PCNT_CNT_THR_THRES0_LAT_U2_S  3
/* PCNT_CNT_THR_THRES1_LAT_U2 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES1_LAT_U2  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U2_M  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U2_V  0x1
#define PCNT_CNT_THR_THRES1_LAT_U2_S  2
/* PCNT_CNT_THR_ZERO_MODE_U2 : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_MODE_U2  0x00000003
#define PCNT_CNT_THR_ZERO_MODE_U2_M  ((PCNT_CNT_THR_ZERO_MODE_U2_V)<<(PCNT_CNT_THR_ZERO_MODE_U2_S))
#define PCNT_CNT_THR_ZERO_MODE_U2_V  0x3
#define PCNT_CNT_THR_ZERO_MODE_U2_S  0

#define PCNT_U3_STATUS_REG          (DR_REG_PCNT_BASE + 0x009c)
/* PCNT_CNT_THR_ZERO_LAT_U3 : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_LAT_U3  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U3_M  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U3_V  0x1
#define PCNT_CNT_THR_ZERO_LAT_U3_S  6
/* PCNT_CNT_THR_H_LIM_LAT_U3 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_H_LIM_LAT_U3  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U3_M  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U3_V  0x1
#define PCNT_CNT_THR_H_LIM_LAT_U3_S  5
/* PCNT_CNT_THR_L_LIM_LAT_U3 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_L_LIM_LAT_U3  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U3_M  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U3_V  0x1
#define PCNT_CNT_THR_L_LIM_LAT_U3_S  4
/* PCNT_CNT_THR_THRES0_LAT_U3 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES0_LAT_U3  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U3_M  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U3_V  0x1
#define PCNT_CNT_THR_THRES0_LAT_U3_S  3
/* PCNT_CNT_THR_THRES1_LAT_U3 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES1_LAT_U3  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U3_M  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U3_V  0x1
#define PCNT_CNT_THR_THRES1_LAT_U3_S  2
/* PCNT_CNT_THR_ZERO_MODE_U3 : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_MODE_U3  0x00000003
#define PCNT_CNT_THR_ZERO_MODE_U3_M  ((PCNT_CNT_THR_ZERO_MODE_U3_V)<<(PCNT_CNT_THR_ZERO_MODE_U3_S))
#define PCNT_CNT_THR_ZERO_MODE_U3_V  0x3
#define PCNT_CNT_THR_ZERO_MODE_U3_S  0

#define PCNT_U4_STATUS_REG          (DR_REG_PCNT_BASE + 0x00a0)
/* PCNT_CNT_THR_ZERO_LAT_U4 : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_LAT_U4  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U4_M  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U4_V  0x1
#define PCNT_CNT_THR_ZERO_LAT_U4_S  6
/* PCNT_CNT_THR_H_LIM_LAT_U4 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_H_LIM_LAT_U4  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U4_M  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U4_V  0x1
#define PCNT_CNT_THR_H_LIM_LAT_U4_S  5
/* PCNT_CNT_THR_L_LIM_LAT_U4 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_L_LIM_LAT_U4  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U4_M  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U4_V  0x1
#define PCNT_CNT_THR_L_LIM_LAT_U4_S  4
/* PCNT_CNT_THR_THRES0_LAT_U4 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES0_LAT_U4  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U4_M  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U4_V  0x1
#define PCNT_CNT_THR_THRES0_LAT_U4_S  3
/* PCNT_CNT_THR_THRES1_LAT_U4 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES1_LAT_U4  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U4_M  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U4_V  0x1
#define PCNT_CNT_THR_THRES1_LAT_U4_S  2
/* PCNT_CNT_THR_ZERO_MODE_U4 : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_MODE_U4  0x00000003
#define PCNT_CNT_THR_ZERO_MODE_U4_M  ((PCNT_CNT_THR_ZERO_MODE_U4_V)<<(PCNT_CNT_THR_ZERO_MODE_U4_S))
#define PCNT_CNT_THR_ZERO_MODE_U4_V  0x3
#define PCNT_CNT_THR_ZERO_MODE_U4_S  0

