espressif/esp-idf/components/soc/esp32s2beta/include/soc/pcnt_reg.h
#define PCNT_U5_STATUS_REG          (DR_REG_PCNT_BASE + 0x00a4)
/* PCNT_CNT_THR_ZERO_LAT_U5 : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_LAT_U5  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U5_M  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U5_V  0x1
#define PCNT_CNT_THR_ZERO_LAT_U5_S  6
/* PCNT_CNT_THR_H_LIM_LAT_U5 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_H_LIM_LAT_U5  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U5_M  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U5_V  0x1
#define PCNT_CNT_THR_H_LIM_LAT_U5_S  5
/* PCNT_CNT_THR_L_LIM_LAT_U5 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_L_LIM_LAT_U5  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U5_M  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U5_V  0x1
#define PCNT_CNT_THR_L_LIM_LAT_U5_S  4
/* PCNT_CNT_THR_THRES0_LAT_U5 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES0_LAT_U5  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U5_M  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U5_V  0x1
#define PCNT_CNT_THR_THRES0_LAT_U5_S  3
/* PCNT_CNT_THR_THRES1_LAT_U5 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES1_LAT_U5  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U5_M  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U5_V  0x1
#define PCNT_CNT_THR_THRES1_LAT_U5_S  2
/* PCNT_CNT_THR_ZERO_MODE_U5 : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_MODE_U5  0x00000003
#define PCNT_CNT_THR_ZERO_MODE_U5_M  ((PCNT_CNT_THR_ZERO_MODE_U5_V)<<(PCNT_CNT_THR_ZERO_MODE_U5_S))
#define PCNT_CNT_THR_ZERO_MODE_U5_V  0x3
#define PCNT_CNT_THR_ZERO_MODE_U5_S  0

#define PCNT_U6_STATUS_REG          (DR_REG_PCNT_BASE + 0x00a8)
/* PCNT_CNT_THR_ZERO_LAT_U6 : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_LAT_U6  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U6_M  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U6_V  0x1
#define PCNT_CNT_THR_ZERO_LAT_U6_S  6
/* PCNT_CNT_THR_H_LIM_LAT_U6 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_H_LIM_LAT_U6  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U6_M  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U6_V  0x1
#define PCNT_CNT_THR_H_LIM_LAT_U6_S  5
/* PCNT_CNT_THR_L_LIM_LAT_U6 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_L_LIM_LAT_U6  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U6_M  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U6_V  0x1
#define PCNT_CNT_THR_L_LIM_LAT_U6_S  4
/* PCNT_CNT_THR_THRES0_LAT_U6 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES0_LAT_U6  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U6_M  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U6_V  0x1
#define PCNT_CNT_THR_THRES0_LAT_U6_S  3
/* PCNT_CNT_THR_THRES1_LAT_U6 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES1_LAT_U6  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U6_M  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U6_V  0x1
#define PCNT_CNT_THR_THRES1_LAT_U6_S  2
/* PCNT_CNT_THR_ZERO_MODE_U6 : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_MODE_U6  0x00000003
#define PCNT_CNT_THR_ZERO_MODE_U6_M  ((PCNT_CNT_THR_ZERO_MODE_U6_V)<<(PCNT_CNT_THR_ZERO_MODE_U6_S))
#define PCNT_CNT_THR_ZERO_MODE_U6_V  0x3
#define PCNT_CNT_THR_ZERO_MODE_U6_S  0

#define PCNT_U7_STATUS_REG          (DR_REG_PCNT_BASE + 0x00ac)
/* PCNT_CNT_THR_ZERO_LAT_U7 : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_LAT_U7  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U7_M  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U7_V  0x1
#define PCNT_CNT_THR_ZERO_LAT_U7_S  6
/* PCNT_CNT_THR_H_LIM_LAT_U7 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_H_LIM_LAT_U7  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U7_M  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U7_V  0x1
#define PCNT_CNT_THR_H_LIM_LAT_U7_S  5
/* PCNT_CNT_THR_L_LIM_LAT_U7 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_L_LIM_LAT_U7  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U7_M  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U7_V  0x1
#define PCNT_CNT_THR_L_LIM_LAT_U7_S  4
/* PCNT_CNT_THR_THRES0_LAT_U7 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES0_LAT_U7  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U7_M  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U7_V  0x1
#define PCNT_CNT_THR_THRES0_LAT_U7_S  3
/* PCNT_CNT_THR_THRES1_LAT_U7 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define PCNT_CNT_THR_THRES1_LAT_U7  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U7_M  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U7_V  0x1
#define PCNT_CNT_THR_THRES1_LAT_U7_S  2
/* PCNT_CNT_THR_ZERO_MODE_U7 : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: */
#define PCNT_CNT_THR_ZERO_MODE_U7  0x00000003
#define PCNT_CNT_THR_ZERO_MODE_U7_M  ((PCNT_CNT_THR_ZERO_MODE_U7_V)<<(PCNT_CNT_THR_ZERO_MODE_U7_S))
#define PCNT_CNT_THR_ZERO_MODE_U7_V  0x3
#define PCNT_CNT_THR_ZERO_MODE_U7_S  0

#define PCNT_CTRL_REG          (DR_REG_PCNT_BASE + 0x00b0)
/* PCNT_CLK_EN : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define PCNT_CLK_EN  (BIT(16))
#define PCNT_CLK_EN_M  (BIT(16))
#define PCNT_CLK_EN_V  0x1
#define PCNT_CLK_EN_S  16
/* PCNT_CNT_PAUSE_U7 : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: Set this bit to pause unit7's counter.*/
#define PCNT_CNT_PAUSE_U7  (BIT(15))
#define PCNT_CNT_PAUSE_U7_M  (BIT(15))
#define PCNT_CNT_PAUSE_U7_V  0x1
#define PCNT_CNT_PAUSE_U7_S  15
/* PCNT_PULSE_CNT_RST_U7 : R/W ;bitpos:[14] ;default: 1'b1 ; */
/*description: */
#define PCNT_PULSE_CNT_RST_U7  (BIT(14))
#define PCNT_PULSE_CNT_RST_U7_M  (BIT(14))
#define PCNT_PULSE_CNT_RST_U7_V  0x1
#define PCNT_PULSE_CNT_RST_U7_S  14
/* PCNT_CNT_PAUSE_U6 : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: Set this bit to pause unit6's counter.*/
#define PCNT_CNT_PAUSE_U6  (BIT(13))
#define PCNT_CNT_PAUSE_U6_M  (BIT(13))
#define PCNT_CNT_PAUSE_U6_V  0x1
#define PCNT_CNT_PAUSE_U6_S  13
/* PCNT_PULSE_CNT_RST_U6 : R/W ;bitpos:[12] ;default: 1'b1 ; */
/*description: */
#define PCNT_PULSE_CNT_RST_U6  (BIT(12))
#define PCNT_PULSE_CNT_RST_U6_M  (BIT(12))
#define PCNT_PULSE_CNT_RST_U6_V  0x1
#define PCNT_PULSE_CNT_RST_U6_S  12
/* PCNT_CNT_PAUSE_U5 : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: Set this bit to pause unit5's counter.*/
#define PCNT_CNT_PAUSE_U5  (BIT(11))
#define PCNT_CNT_PAUSE_U5_M  (BIT(11))
#define PCNT_CNT_PAUSE_U5_V  0x1
#define PCNT_CNT_PAUSE_U5_S  11
/* PCNT_PULSE_CNT_RST_U5 : R/W ;bitpos:[10] ;default: 1'b1 ; */
/*description: */
#define PCNT_PULSE_CNT_RST_U5  (BIT(10))
#define PCNT_PULSE_CNT_RST_U5_M  (BIT(10))
#define PCNT_PULSE_CNT_RST_U5_V  0x1
#define PCNT_PULSE_CNT_RST_U5_S  10
/* PCNT_CNT_PAUSE_U4 : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to pause unit4's counter.*/
#define PCNT_CNT_PAUSE_U4  (BIT(9))
#define PCNT_CNT_PAUSE_U4_M  (BIT(9))
#define PCNT_CNT_PAUSE_U4_V  0x1
#define PCNT_CNT_PAUSE_U4_S  9
/* PCNT_PULSE_CNT_RST_U4 : R/W ;bitpos:[8] ;default: 1'b1 ; */
/*description: */
#define PCNT_PULSE_CNT_RST_U4  (BIT(8))
#define PCNT_PULSE_CNT_RST_U4_M  (BIT(8))
#define PCNT_PULSE_CNT_RST_U4_V  0x1
#define PCNT_PULSE_CNT_RST_U4_S  8
/* PCNT_CNT_PAUSE_U3 : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to pause unit3's counter.*/
#define PCNT_CNT_PAUSE_U3  (BIT(7))
#define PCNT_CNT_PAUSE_U3_M  (BIT(7))
#define PCNT_CNT_PAUSE_U3_V  0x1
#define PCNT_CNT_PAUSE_U3_S  7
/* PCNT_PULSE_CNT_RST_U3 : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: */
#define PCNT_PULSE_CNT_RST_U3  (BIT(6))
#define PCNT_PULSE_CNT_RST_U3_M  (BIT(6))
#define PCNT_PULSE_CNT_RST_U3_V  0x1
#define PCNT_PULSE_CNT_RST_U3_S  6
/* PCNT_CNT_PAUSE_U2 : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to pause unit2's counter.*/
#define PCNT_CNT_PAUSE_U2  (BIT(5))
#define PCNT_CNT_PAUSE_U2_M  (BIT(5))
#define PCNT_CNT_PAUSE_U2_V  0x1
#define PCNT_CNT_PAUSE_U2_S  5
/* PCNT_PULSE_CNT_RST_U2 : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: */
#define PCNT_PULSE_CNT_RST_U2  (BIT(4))
#define PCNT_PULSE_CNT_RST_U2_M  (BIT(4))
#define PCNT_PULSE_CNT_RST_U2_V  0x1
#define PCNT_PULSE_CNT_RST_U2_S  4
/* PCNT_CNT_PAUSE_U1 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to pause unit1's counter.*/
#define PCNT_CNT_PAUSE_U1  (BIT(3))
#define PCNT_CNT_PAUSE_U1_M  (BIT(3))
#define PCNT_CNT_PAUSE_U1_V  0x1
#define PCNT_CNT_PAUSE_U1_S  3
/* PCNT_PULSE_CNT_RST_U1 : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: */
#define PCNT_PULSE_CNT_RST_U1  (BIT(2))
#define PCNT_PULSE_CNT_RST_U1_M  (BIT(2))
#define PCNT_PULSE_CNT_RST_U1_V  0x1
#define PCNT_PULSE_CNT_RST_U1_S  2
/* PCNT_CNT_PAUSE_U0 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to pause unit0's counter.*/
#define PCNT_CNT_PAUSE_U0  (BIT(1))
#define PCNT_CNT_PAUSE_U0_M  (BIT(1))
#define PCNT_CNT_PAUSE_U0_V  0x1
#define PCNT_CNT_PAUSE_U0_S  1
/* PCNT_PULSE_CNT_RST_U0 : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define PCNT_PULSE_CNT_RST_U0  (BIT(0))
#define PCNT_PULSE_CNT_RST_U0_M  (BIT(0))
#define PCNT_PULSE_CNT_RST_U0_V  0x1
#define PCNT_PULSE_CNT_RST_U0_S  0

#define PCNT_DATE_REG          (DR_REG_PCNT_BASE + 0x00fc)
/* PCNT_DATE : R/W ;bitpos:[31:0] ;default: 32'h14122600 ; */
/*description: */
#define PCNT_DATE  0xFFFFFFFF
#define PCNT_DATE_M  ((PCNT_DATE_V)<<(PCNT_DATE_S))
#define PCNT_DATE_V  0xFFFFFFFF
#define PCNT_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_PCNT_REG_H_ */


